zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K341_BCTU.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K341_BCTU.h
 * @version 1.1
 * @date 2023-02-02
 * @brief Peripheral Access Layer for S32K341_BCTU
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K341_BCTU_H_)  /* Check if memory map has not been already included */
#define S32K341_BCTU_H_

#include "S32K341_COMMON.h"

/* ----------------------------------------------------------------------------
   -- BCTU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup BCTU_Peripheral_Access_Layer BCTU Peripheral Access Layer
 * @{
 */

/** BCTU - Size of Registers Arrays */
#define BCTU_TRGCFG_COUNT                         48u
#define BCTU_ADCDR_COUNT                          2u
#define BCTU_LISTCHR_COUNT                        16u

/** BCTU - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration, offset: 0x0 */
  uint8_t RESERVED_0[4];
  __IO uint32_t MSR;                               /**< Module Status, offset: 0x8 */
  uint8_t RESERVED_1[12];
  __IO uint32_t TRGCFG[BCTU_TRGCFG_COUNT];         /**< Trigger Configuration, array offset: 0x18, array step: 0x4 */
  uint8_t RESERVED_2[336];
  __IO uint32_t WRPROT;                            /**< Write Protection, offset: 0x228 */
  __IO uint32_t SFTRGR1;                           /**< Software Trigger 1, offset: 0x22C */
  __IO uint32_t SFTRGR2;                           /**< Software Trigger 2, offset: 0x230 */
  uint8_t RESERVED_3[8];
  __I  uint32_t ADCDR[BCTU_ADCDR_COUNT];           /**< ADC0 Result Data..ADC1 Result Data, array offset: 0x23C, array step: 0x4 */
  uint8_t RESERVED_4[8];
  __I  uint32_t LISTSTAR;                          /**< CL Size Status, offset: 0x24C */
  __IO uint32_t LISTCHR[BCTU_LISTCHR_COUNT];       /**< CL Channel Address, array offset: 0x250, array step: 0x4 */
  uint8_t RESERVED_5[448];
  __I  uint32_t FIFO1DR;                           /**< FIFO Result Data, offset: 0x450 */
  __I  uint32_t FIFO2DR;                           /**< FIFO Result Data, offset: 0x454 */
  uint8_t RESERVED_6[8];
  __IO uint32_t FIFOCR;                            /**< FIFO Control, offset: 0x460 */
  __IO uint32_t FIFOWM;                            /**< FIFO Watermark Configuration, offset: 0x464 */
  __IO uint32_t FIFOERR;                           /**< FIFO Error/Status, offset: 0x468 */
  __I  uint32_t FIFOSR;                            /**< FIFO Status, offset: 0x46C */
  __I  uint32_t FIFOCNTR;                          /**< FIFO Counter, offset: 0x470 */
} BCTU_Type, *BCTU_MemMapPtr;

/** Number of instances of the BCTU module. */
#define BCTU_INSTANCE_COUNT                      (1u)

/* BCTU - Peripheral instance base addresses */
/** Peripheral BCTU base address */
#define IP_BCTU_BASE                             (0x40084000u)
/** Peripheral BCTU base pointer */
#define IP_BCTU                                  ((BCTU_Type *)IP_BCTU_BASE)
/** Array initializer of BCTU peripheral base addresses */
#define IP_BCTU_BASE_ADDRS                       { IP_BCTU_BASE }
/** Array initializer of BCTU peripheral base pointers */
#define IP_BCTU_BASE_PTRS                        { IP_BCTU }

/* ----------------------------------------------------------------------------
   -- BCTU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup BCTU_Register_Masks BCTU Register Masks
 * @{
 */

/*! @name MCR - Module Configuration */
/*! @{ */

#define BCTU_MCR_IEN0_MASK                       (0x1U)
#define BCTU_MCR_IEN0_SHIFT                      (0U)
#define BCTU_MCR_IEN0_WIDTH                      (1U)
#define BCTU_MCR_IEN0(x)                         (((uint32_t)(((uint32_t)(x)) << BCTU_MCR_IEN0_SHIFT)) & BCTU_MCR_IEN0_MASK)

#define BCTU_MCR_IEN1_MASK                       (0x2U)
#define BCTU_MCR_IEN1_SHIFT                      (1U)
#define BCTU_MCR_IEN1_WIDTH                      (1U)
#define BCTU_MCR_IEN1(x)                         (((uint32_t)(((uint32_t)(x)) << BCTU_MCR_IEN1_SHIFT)) & BCTU_MCR_IEN1_MASK)

#define BCTU_MCR_LIST_IEN_MASK                   (0x20U)
#define BCTU_MCR_LIST_IEN_SHIFT                  (5U)
#define BCTU_MCR_LIST_IEN_WIDTH                  (1U)
#define BCTU_MCR_LIST_IEN(x)                     (((uint32_t)(((uint32_t)(x)) << BCTU_MCR_LIST_IEN_SHIFT)) & BCTU_MCR_LIST_IEN_MASK)

#define BCTU_MCR_TRGEN_MASK                      (0x80U)
#define BCTU_MCR_TRGEN_SHIFT                     (7U)
#define BCTU_MCR_TRGEN_WIDTH                     (1U)
#define BCTU_MCR_TRGEN(x)                        (((uint32_t)(((uint32_t)(x)) << BCTU_MCR_TRGEN_SHIFT)) & BCTU_MCR_TRGEN_MASK)

